objectweb/trunk/celtix-rt/src/test/java/org/objectweb/celtix/bus/bindings/soap/resources/TestHeader1Req.xml

<?xml version="1.0" encoding="utf-8" ?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">	<SOAP-ENV:Header><ns4:testHeader1 xmlns:ns4="http://objectweb.org/header_test/types"/></SOAP-ENV:Header><SOAP-ENV:Body><ns4:testHeader1 xmlns:ns4="http://objectweb.org/header_test/types"/></SOAP-ENV:Body></SOAP-ENV:Envelope>